export const fakeTeams = [
  {
    id: "1",
    status: "recruiting" as "recruiting" | "closed" | "closingSoon",
    title: "스마트 시티 구축을 위한 IoT 시스템 개발 팀원 모집",
    active: true,
    name: "김철수",
    view: 1204,
    date: new Date("2025-03-01"),
    description:
      "IoT 센서와 데이터를 활용하여 실시간 도시 관리 시스템을 구축하는 프로젝트입니다. 관심 있는 분들의 많은 지원 바랍니다.",
    leaderIntroduction:
      "안녕하세요, 스마트 시티 구축을 위한 IoT 시스템 개발 프로젝트를 같이 진행하실 분들을 찾습니다. 저는 전기전자공학과 2020123123 김철수입니다. 현재 3학년이고, 과거에 스마트 홈 시스템 구축 프로젝트를 진행해본 경험이 있습니다. 이를 통해 IoT 기술을 실제로 적용하는 경험을 쌓았고, 해당 기술을 활용한 스마트 시티 구축에 대한 깊은 이해를 가지고 있습니다. 이번 프로젝트를 통해 IoT를 활용한 도시 문제 해결을 목표로 하고 있습니다.",
    qualification:
      "이 프로젝트에는 IoT 기술에 대한 깊은 이해와 스마트 시티 구축 경험이 있는 분들을 찾고 있습니다. 관련 전공자뿐만 아니라, IoT 기술을 실무에 적용한 경험이 있는 분들을 우대합니다. 또한, 프로젝트 리더와의 협업을 통해 스마트 시티의 전반적인 구조에 대한 이해를 넓힐 수 있는 기회를 제공합니다.",
    leadingProfessor: "박진수 교수",
    extraDescription:
      "스마트 시티는 미래의 도시 관리 모델로, 효율적이고 지속 가능한 도시를 구현하는 중요한 기술입니다. 이 프로젝트는 IoT 기술을 기반으로 스마트 시티의 관리 및 서비스를 최적화하는 데 중점을 두고 있으며, IoT 시스템 개발에 관심이 많은 분들에게 좋은 기회입니다. 참여하시면 실제적인 기술 개발 경험과 함께 사회적 가치 창출에 기여하는 기회를 얻을 수 있습니다.",
  },
  {
    id: "2",
    status: "closed" as "recruiting" | "closed" | "closingSoon",
    title: "자율주행차 관련 연구 팀원 모집",
    active: true,
    name: "이수진",
    view: 1345,
    date: new Date("2025-02-15"),
    description:
      "자율주행차의 기술 발전과 함께 법적, 윤리적 문제를 해결하는 방안을 제시할 것입니다. 자율주행차 관련 연구에 관심이 있는 분들의 많은 참여를 부탁드립니다.",
    leaderIntroduction:
      "안녕하세요, 자율주행차 관련 연구 프로젝트 팀원을 모집합니다. 저는 컴퓨터공학과 2020123456 이수진입니다. 현재 4학년이고, 자율주행차 시뮬레이션 개발 프로젝트에 참여한 경험이 있습니다. 이번 프로젝트에서는 자율주행차의 기술적 도전 과제와 사회적 문제를 해결하기 위한 연구를 진행하며, 이를 통해 미래의 교통 환경에 기여하고자 합니다. 이 연구는 자율주행차가 사회에 미치는 영향을 다양한 측면에서 분석하려는 목표를 가지고 있습니다.",
    qualification:
      "자율주행차 기술과 관련된 연구 경험이 있거나, 자율주행차 관련 기술에 대한 깊은 이해가 있는 분들을 찾고 있습니다. 자율주행차의 기술적, 윤리적, 법적 측면에 대한 분석이 중요한 연구이므로, 관련 전공자 및 연구 경험이 있는 분들을 우대합니다. 또한, 팀 내에서 활발히 의견을 나누고 협력할 수 있는 분들을 선호합니다.",
    leadingProfessor: "김상호 교수",
    extraDescription:
      "자율주행차는 미래 교통 혁신을 이끌 중요한 기술입니다. 하지만 자율주행차의 도입에는 기술적인 문제뿐만 아니라 법적, 윤리적 문제도 동반됩니다. 이 프로젝트는 이러한 문제들을 체계적으로 연구하여 해결책을 제시하고, 자율주행차가 안전하고 윤리적으로 운행될 수 있도록 기여하는 것을 목표로 합니다. 이 분야에 깊은 관심과 열정을 가진 분들의 많은 참여를 기다립니다.",
  },
  {
    id: "3",
    status: "closingSoon" as "recruiting" | "closed" | "closingSoon",
    title: "AI 기반 의료 혁신 팀원 모집",
    active: true,
    name: "박영민",
    view: 1503,
    date: new Date("2025-02-28"),
    description:
      "맞춤형 치료와 예측 분석을 통해 의료 서비스의 질을 향상시키는 데 참여하고 싶은 분들의 많은 지원을 바랍니다.",
    leaderIntroduction:
      "안녕하세요, AI 기반 의료 혁신 프로젝트 팀원을 모집합니다. 저는 생명과학과 2020101010 박영민입니다. 현재 3학년이며, 과거에 의료 데이터 분석 프로젝트를 진행해본 경험이 있습니다. 의료 분야에서 AI를 활용한 혁신적인 해결책을 제시하고자 하며, 데이터 기반의 맞춤형 치료와 예측 분석을 통해 의료 서비스의 질을 향상시키고자 합니다. 의료 산업의 발전에 기여하는 이 프로젝트에 많은 관심을 부탁드립니다.",
    qualification:
      "AI 및 빅데이터 기술에 대한 깊은 이해가 있는 분들을 찾고 있습니다. 의료 분야에 관심이 있고, 데이터 분석 및 모델링 경험이 있는 분들을 우대합니다. 또한, 협업을 통해 혁신적인 의료 서비스를 구현할 수 있는 분들을 환영합니다.",
    leadingProfessor: "이형준 교수",
    extraDescription:
      "의료 분야는 AI와 빅데이터 기술을 통해 큰 변화를 겪고 있습니다. 이 프로젝트는 의료의 질을 높이고, 맞춤형 치료를 제공하는 것을 목표로 합니다. 특히, 데이터 분석을 통해 환자의 상태를 보다 정확하게 예측하고, 치료 방법을 최적화하는 방법을 연구합니다. 이 분야에 관심이 많은 분들은 많은 지원 부탁드립니다.",
  },
  {
    id: "4",
    status: "recruiting" as "recruiting" | "closed" | "closingSoon",
    title: "블록체인 기술을 활용한 금융 시스템 혁신 팀원 모집",
    active: true,
    name: "최미영",
    view: 1160,
    date: new Date("2025-03-02"),
    description:
      "블록체인 기술을 활용하여 더 안전하고 투명한 금융 시스템을 구축하기 위한 팀을 모집합니다",
    leaderIntroduction:
      "안녕하세요, 블록체인 기반 금융 시스템 혁신 프로젝트 팀원을 모집합니다. 저는 금융학과 2020112233 최미영입니다. 저는 현재 4학년이며, 과거에 블록체인 기술을 활용한 암호화폐 연구 프로젝트를 진행한 경험이 있습니다. 이 프로젝트를 통해 블록체인 기술이 금융 시스템에 미치는 영향을 연구하고, 더 안전하고 투명한 금융 시스템을 구축하는 방안을 제시할 수 있습니다.",
    qualification:
      "블록체인 기술에 대한 깊은 이해와 금융 시스템의 보안 문제를 해결하는 데 관심이 있는 분들을 찾고 있습니다. 특히, 블록체인 기술을 이용한 솔루션 개발 경험이 있는 분들을 우대하며, 금융 분야의 문제 해결에 관심이 많은 분들을 모집합니다.",
    leadingProfessor: "조승훈 교수",
    extraDescription:
      "블록체인 기술은 금융 시스템에 혁신을 가져올 수 있는 중요한 기술입니다. 이 프로젝트는 보안 문제를 해결하고, 블록체인 기반으로 더 안전하고 투명한 금융 시스템을 구축하는 것을 목표로 하고 있습니다. 블록체인에 대한 관심이 깊고, 금융 시스템 혁신에 기여하고자 하는 분들은 많은 지원을 바랍니다.",
  },
  {
    id: "5",
    status: "recruiting" as "recruiting" | "closed" | "closingSoon",
    title: "5G 기술 상용화 연구 팀원 모집",
    active: true,
    name: "정희수",
    view: 980,
    date: new Date("2025-02-25"),
    description:
      "5G 기술이 산업과 사회에 미칠 영향을 연구하고, 이를 통해 미래의 통신 환경을 선도할 팀원들을 찾고 있습니다.",
    leaderIntroduction:
      "안녕하세요, 5G 기술 상용화 연구 프로젝트 팀원을 모집합니다. 저는 전자공학과 2020132456 정희수입니다. 현재 3학년이며, 5G 기술 상용화 관련 연구 프로젝트에 참여한 경험이 있습니다. 5G 기술은 미래 통신 기술의 핵심이며, 이 프로젝트를 통해 이를 상용화하고, 산업과 사회에 미칠 영향을 분석하고 있습니다. 여러분의 많은 참여를 바랍니다.",
    qualification:
      "5G 기술에 대한 깊은 이해와 상용화 가능성에 대한 분석 경험이 있는 분들을 우대합니다. 또한, 차세대 통신 기술이 산업에 미치는 영향을 분석하고, 사회적 영향을 고려한 연구가 필요한 만큼, 관련 전공자 및 연구 경험이 있는 분들을 찾고 있습니다.",
    leadingProfessor: "한상민 교수",
    extraDescription: "5G 기술은 미래 통신 환경을 변화시킬 중요한 기술입니다.",
  },
];
